In [29]:
pip install pandas

Requirement already satisfied: pandas in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (2.1.1)
Requirement already satisfied: numpy>=1.23.2 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [30]:
import pandas as pd
df = pd.read_csv("C:\\Users\\HP\\Documents\\Data.csv")
print(df)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [ ]:
df.head(7)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No

In [ ]:
df.tail()

   Country   Age   Salary Purchased
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [ ]:
df.tail(-1)

   Country   Age   Salary Purchased
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [ ]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 452.0+ bytes
None

In [ ]:
print(df.describe)

<bound method NDFrame.describe of    Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes>

In [ ]:
df1=df.dropna()
print(df1)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [ ]:
x = df["Salary"].mean()
print(x)
y = df["Salary"].median()
print(y)

63777.77777777778
61000.0

In [ ]:
a = df["Age"].mean()
print(a)
b = df["Age"].median()
print(b)

38.77777777777778
38.0

In [ ]:
df.shape

(10, 4)

In [ ]:
df.isnull()

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [ ]:
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [ ]:
df["Salary"].fillna(x, inplace = True)
print(df)

   Country   Age        Salary Purchased
0   France  44.0  72000.000000        No
1    Spain  27.0  48000.000000       Yes
2  Germany  30.0  54000.000000        No
3    Spain  38.0  61000.000000        No
4  Germany  40.0  63777.777778       Yes
5   France  35.0  58000.000000       Yes
6    Spain   NaN  52000.000000        No
7   France  48.0  79000.000000       Yes
8  Germany  50.0  83000.000000        No
9   France  37.0  67000.000000       Yes

In [ ]:
df["Age"].fillna(y, inplace = True)
print(df)

   Country      Age        Salary Purchased
0   France     44.0  72000.000000        No
1    Spain     27.0  48000.000000       Yes
2  Germany     30.0  54000.000000        No
3    Spain     38.0  61000.000000        No
4  Germany     40.0  63777.777778       Yes
5   France     35.0  58000.000000       Yes
6    Spain  61000.0  52000.000000        No
7   France     48.0  79000.000000       Yes
8  Germany     50.0  83000.000000        No
9   France     37.0  67000.000000       Yes

In [ ]:
print(df.loc[0,"Age"])

44.0

In [ ]:
print(df.iloc[1])

Country        Spain
Age             27.0
Salary       48000.0
Purchased        Yes
Name: 1, dtype: object

In [ ]:
X = df.iloc[:, :-1].values   #:all rows column last 1 delete
Y = df.iloc[:,3].values

print(X)
print(Y)

[['France' 44.0 72000.0]
 ['Spain' 27.0 48000.0]
 ['Germany' 30.0 54000.0]
 ['Spain' 38.0 61000.0]
 ['Germany' 40.0 63777.77777777778]
 ['France' 35.0 58000.0]
 ['Spain' 61000.0 52000.0]
 ['France' 48.0 79000.0]
 ['Germany' 50.0 83000.0]
 ['France' 37.0 67000.0]]
['No' 'Yes' 'No' 'No' 'Yes' 'Yes' 'No' 'Yes' 'No' 'Yes']

In [ ]:
from sklearn.preprocessing import LabelEncoder #categorical data converts into numerical data but assign unique no starting from 0 to each class of data
labelencoder_X = LabelEncoder()
X[:, 0] = labelencoder_X.fit_transform(X[:,0])
print(X)

[[0 44.0 72000.0]
 [2 27.0 48000.0]
 [1 30.0 54000.0]
 [2 38.0 61000.0]
 [1 40.0 63777.77777777778]
 [0 35.0 58000.0]
 [2 61000.0 52000.0]
 [0 48.0 79000.0]
 [1 50.0 83000.0]
 [0 37.0 67000.0]]

In [ ]:
le = LabelEncoder()
df['Country_Encoded'] = le.fit_transform(df['Country'])

# Calculate mean, mode, median for 'Gender' column
mean_gender = df['Country_Encoded'].mean()
mode_gender = df['Country_Encoded'].mode()[0]
median_gender = df['Country_Encoded'].median()

decoded_mode = le.inverse_transform([mode_gender])[0]

print(f"Mean of Gender (encoded): {mean_gender}")
print(f"Mode of Gender (encoded): {mode_gender} (decoded: {decoded_mode})")
print(f"Median of Gender (encoded): {median_gender}")

Mean of Gender (encoded): 0.9
Mode of Gender (encoded): 0 (decoded: France)
Median of Gender (encoded): 1.0

In [ ]:
print(df.mean(numeric_only=True))

Age                 6134.900000
Salary             63777.777778
Country_Encoded        0.900000
dtype: float64

In [ ]:
pip install scikit-learn

Requirement already satisfied: scikit-learn in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (1.3.1)
Requirement already satisfied: numpy<2.0,>=1.17.3 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from scikit-learn) (1.24.3)
Requirement already satisfied: scipy>=1.5.0 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from scikit-learn) (1.11.2)
Requirement already satisfied: joblib>=1.1.1 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from scikit-learn) (1.3.2)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\hp\appdata\local\programs\python\python311\lib\site-packages (from scikit-learn) (3.2.0)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
labelencoder_Y = LabelEncoder()
Y = labelencoder_Y.fit_transform(Y)
print(Y)

[0 1 0 0 1 1 0 1 0 1]

In [ ]:
from sklearn.preprocessing import StandardScaler
sc_X = StandardScaler()
X_sc = sc_X.fit_transform(X)
X_sc

array([[-1.08347268e+00, -3.33047761e-01,  7.49473254e-01],
       [ 1.32424438e+00, -3.33977313e-01, -1.43817841e+00],
       [ 1.20385853e-01, -3.33813275e-01, -8.91265492e-01],
       [ 1.32424438e+00, -3.33375838e-01, -2.53200424e-01],
       [ 1.20385853e-01, -3.33266479e-01,  6.63219199e-16],
       [-1.08347268e+00, -3.33539877e-01, -5.26656882e-01],
       [ 1.32424438e+00,  2.99999979e+00, -1.07356980e+00],
       [-1.08347268e+00, -3.32829043e-01,  1.38753832e+00],
       [ 1.20385853e-01, -3.32719684e-01,  1.75214693e+00],
       [-1.08347268e+00, -3.33430518e-01,  2.93712492e-01]])

In [ ]:
from sklearn.preprocessing import MinMaxScaler     #normalized value = value - min / max - min
scaler = MinMaxScaler()
scalerdata = scaler.fit_transform(X)
print(scalerdata)

[[0.00000000e+00 2.78811933e-04 6.85714286e-01]
 [1.00000000e+00 0.00000000e+00 0.00000000e+00]
 [5.00000000e-01 4.92021059e-05 1.71428571e-01]
 [1.00000000e+00 1.80407721e-04 3.71428571e-01]
 [5.00000000e-01 2.13209125e-04 4.50793651e-01]
 [0.00000000e+00 1.31205616e-04 2.85714286e-01]
 [1.00000000e+00 1.00000000e+00 1.14285714e-01]
 [0.00000000e+00 3.44414741e-04 8.85714286e-01]
 [5.00000000e-01 3.77216145e-04 1.00000000e+00]
 [0.00000000e+00 1.64007020e-04 5.42857143e-01]]